## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 12 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                       NAME                                       |
|--------|----------------------------------------------------------------------------------|
| add    | `aws_s3_bucket_acl.archive_storage_acl`                                          |
|        | `aws_s3_bucket_acl.reliability_file_storage_s3_acl`                              |
|        | `aws_s3_bucket_acl.vault_file_storage_acl`                                       |
|        | `aws_s3_bucket_lifecycle_configuration.lifecycle_rules_archive_storage`          |
|        | `aws_s3_bucket_lifecycle_configuration.lifecycle_rules_reliability_file_storage` |
|        | `aws_s3_bucket_ownership_controls.archive_storage_s3_bucket_acl_ownership`       |
|        | `aws_s3_bucket_ownership_controls.reliability_file_s3_bucket_acl_ownership`      |
|        | `aws_s3_bucket_ownership_controls.vault_file_s3_bucket_acl_ownership`            |
|        | `aws_s3_bucket_server_side_encryption_configuration.archive_storage`             |
|        | `aws_s3_bucket_server_side_encryption_configuration.reliability_file_storage`    |
|        | `aws_s3_bucket_server_side_encryption_configuration.vault_file_storage`          |
|        | `aws_s3_bucket_versioning.vault_file_storage_versioning`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket_acl.archive_storage_acl will be created
  + resource "aws_s3_bucket_acl" "archive_storage_acl" {
      + acl    = "private"
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.reliability_file_storage_s3_acl will be created
  + resource "aws_s3_bucket_acl" "reliability_file_storage_s3_acl" {
      + acl    = "private"
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)
    }

  # aws_s3_bucket_acl.vault_file_storage_acl will be created
  + resource "aws_s3_bucket_acl" "vault_file_storage_acl" {
      + acl    = "private"
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.lifecycle_rules_archive_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rules_archive_storage" {
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)

      + rule {
          + id     = "lifecycle_archive_storage"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_lifecycle_configuration.lifecycle_rules_reliability_file_storage will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "lifecycle_rules_reliability_file_storage" {
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + id     = "lifecycle_reliability_file_storage"
          + status = "Enabled"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_ownership_controls.archive_storage_s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "archive_storage_s3_bucket_acl_ownership" {
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.reliability_file_s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "reliability_file_s3_bucket_acl_ownership" {
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.vault_file_s3_bucket_acl_ownership will be created
  + resource "aws_s3_bucket_ownership_controls" "vault_file_s3_bucket_acl_ownership" {
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.archive_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "archive_storage" {
      + bucket = "forms-staging-archive-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.reliability_file_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "reliability_file_storage" {
      + bucket = "forms-staging-reliability-file-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.vault_file_storage will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "vault_file_storage" {
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # aws_s3_bucket_versioning.vault_file_storage_versioning will be created
  + resource "aws_s3_bucket_versioning" "vault_file_storage_versioning" {
      + bucket = "forms-staging-vault-file-storage"
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]

29 tests, 17 passed, 12 warnings, 0 failures, 0 exceptions

```

</details>
